app/Models/Customer/Payment_model.php

SELECT COUNT(*) AS `numrows`
FROM `payments`
WHERE `id` = '11'
---
    public function is_payment_exist($id)
    {
        $this->db = \Config\Database::connect();
        return ($this->db->table('payments')->where('id', $id)->countAllResults() > 0) ? TRUE : FALSE;

SELECT `p`.*, `o`.`order_number`
FROM `payments` `p`
JOIN `orders` `o` ON `o`.`id` = `p`.`order_id`
WHERE `p`.`id` = '11'
---
    public function payment_data($id)
    {
        $this->db = \Config\Database::connect();
        $data = $this->db->table('payments p')->select('p.*, o.order_number')->join('orders o', 'o.id = p.order_id')->where('p.id', $id)->get()->getRow();