app/Models/Customer/Profile_model.php

    public function update_account($data)
    {
        return $this->db->table('users')->where('id', $this->user_id)->update($data);
---
SELECT *
FROM `users`
WHERE `id` = '10'
UPDATE `users` SET `name` = 'Aditio Pratama', `phone_number` = '082282741162', `address` = 'Kota Bengkulu', `profile_picture` = 'tio.png'
WHERE `id` = '10'