app/Controllers/Admin_Products.php

SELECT *
FROM `products`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        if (isset($_GET['category_id'])) {
            $query = $this->request->getGet('category_id');
            $data = [
                'title' => 'Kelola Produk ' . get_store_name(),
                'products' => $this->product->like('category_id', $query)->paginate(8, 'card'),
                'pager' => $this->product->pager
            ];
            return view('admin/products/products', $data);
        }

        $pager = \Config\Services::pager();
        // $products['title'] = 'Kelola Produk ' . get_store_name();
        // $products['products'] = $this->product->paginate(4);
        // $products['pager'] = $this->product->pager;

        $data = [
            'title' => 'Kelola Produk ' . get_store_name(),
            'products' => $this->product->paginate(8, 'card'),