app/Controllers/Admin_Payments.php

SELECT COUNT(*) AS `numrows`
FROM `payments`
JOIN `orders` `o` ON `o`.`id` = `payments`.`order_id`
JOIN `users` `c` ON `c`.`id` = `o`.`user_id`
SELECT `payments`.`id`, `payments`.`payment_date`, `payments`.`order_id`, `payments`.`payment_price`, `payments`.`payment_status` as `status`, `o`.`order_number`, `c`.`name` AS `customer`
FROM `payments`
JOIN `orders` `o` ON `o`.`id` = `payments`.`order_id`
JOIN `users` `c` ON `c`.`id` = `o`.`user_id`
ORDER BY `payments`.`payment_date` DESC
 LIMIT 10
---
    public function index()
    {

        $pager = \Config\Services::pager();
        $currentPage = $this->request->getVar('page_table') ? $this->request->getVar('page_table') : 1;
        $payments = [
            'title' => 'Kelola Pembayaran',
            'payments' => $this->payment
                ->select('payments.id, payments.payment_date, payments.order_id, payments.payment_price, payments.payment_status as status, o.order_number, c.name AS customer')
                ->join('orders o', 'o.id = payments.order_id')
                ->join(' users c', 'c.id = o.user_id')
                ->orderBy('payments.payment_date DESC')
                ->paginate(10, 'table'),