app/Controllers/Admin_Orders.php

    public function index()
    {
        //$search = $this->input->getGet('search_query');

        // if ($search) {
        //     $orders['title'] = 'Cari "' . $search . '"';
        // } else {
        $orders['title'] = 'Kelola Order';
        // }
        $orders['orders'] = $this->order->select('orders.*, u.name, u.id as id_user')->join('users u', 'u.id = orders.user_id')->paginate(10, 'table');
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
JOIN `users` `u` ON `u`.`id` = `orders`.`user_id`
SELECT `orders`.*, `u`.`name`, `u`.`id` as `id_user`
FROM `orders`
JOIN `users` `u` ON `u`.`id` = `orders`.`user_id`
 LIMIT 10