app/Controllers/Customer_Payments.php

SELECT COUNT(*) AS `numrows`
FROM `payments`
JOIN `orders` `o` ON `o`.`id` = `payments`.`order_id`
WHERE `o`.`user_id` = '10'
SELECT `payments`.*, `o`.`order_number`
FROM `payments`
JOIN `orders` `o` ON `o`.`id` = `payments`.`order_id`
WHERE `o`.`user_id` = '10'
ORDER BY `payment_date` DESC
 LIMIT 10
---
    public function index()
    {

        $data = [
            'title' => 'Pembayaran Saya',
            'payments' => $this->payment->select('payments.*, o.order_number')
                ->join('orders o', 'o.id = payments.order_id')
                ->where('o.user_id', user_id())
                ->orderBy('payment_date', 'DESC')
                ->paginate(10, 'table'),