app/Controllers/Customer_Orders.php

    public function index()
    {

        $data = [
            'title' => 'Order Saya',
            'orders' => $this->order->select('orders.id, orders.order_number, orders.order_date, orders.order_status, orders.payment_method, orders.total_price, orders.total_items, c.name AS coupon, cu.name AS customer')
                ->join('coupons c', 'c.id = orders.coupon_id', 'left')
                ->join('users cu', 'cu.id = orders.user_id')
                ->where('orders.user_id', user_id())
                ->orderBy('order_date', 'DESC')
                ->paginate(10, 'table'),
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
LEFT JOIN `coupons` `c` ON `c`.`id` = `orders`.`coupon_id`
JOIN `users` `cu` ON `cu`.`id` = `orders`.`user_id`
WHERE `orders`.`user_id` = '15'
SELECT `orders`.`id`, `orders`.`order_number`, `orders`.`order_date`, `orders`.`order_status`, `orders`.`payment_method`, `orders`.`total_price`, `orders`.`total_items`, `c`.`name` AS `coupon`, `cu`.`name` AS `customer`
FROM `orders`
LEFT JOIN `coupons` `c` ON `c`.`id` = `orders`.`coupon_id`
JOIN `users` `cu` ON `cu`.`id` = `orders`.`user_id`
WHERE `orders`.`user_id` = '15'
ORDER BY `order_date` DESC
 LIMIT 10