app/Controllers/Product.php

SELECT *
FROM `products`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {

        $data = [
            'store_name' => 'Toko Ku',
            'title' => 'Product',
            'products' => $this->ProductModel->paginate(8, 'card'),